Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/F33A.tmx
Source language: en_us
Languages: zh_cn

source: how much money to give at a Japanese wedding?
zh_cn: 日本婚礼该随多少礼金？

source: The recent wedding etiquette post "how to not make a fool of yourself at a Japanese wedding" brought about a lot of thoughts and experiences from fellow foreigners in Japan.
zh_cn: 最近有一篇关于婚礼礼数的帖子，叫做“如何不在一场日本婚礼上出丑”，它提到了许多遭遇过这一情况的在日外国人的看法和经历。

source: Due to the slightly varying ideas regarding gift money, I decided to do a quick poll of Japanese folks on twitter to ask what they consider the norm.
zh_cn: 由于他们在对待礼金这一方面差别显著，所以我决定在推特上对日本当地人做一个快速调查，去了解他们所认为的正常礼金数。

source: Interestingly enough, these responses also varied, but I pulled the consistencies from all the responses, both from Japanese and non-Japanese. One thing to keep in mind is that the gift money also covers the "meal fee" and gifts for the guests.
zh_cn: 然而十分有趣的是，他们的回答同样差别很大，但是我还是从这些本地人的回答和那些外国人的回答当中找到了相同点，那就是需要铭记一件事：礼金同样包含了“餐食费”和客人礼品费。

source: Here are the results:
zh_cn: 结果如下：

source: If you are a:
zh_cn: 如果你身为：

source: Friend
zh_cn: 朋友

source: 20,000 to 30,000 yen, is the standard, up to 50,000 if you are in your 30s/40s.
zh_cn: 标准是20,000到30,000日元，但是如果你已经三，四十岁了，礼金可以多达50,000日元。

source: Traditionally, giving any amount in which the first number was divisible by 2, was considered unlucky and implied that the couple may divorce.
zh_cn: 按照以前的风俗习惯来说，如果所给金额的第一位数字可以被2整除的话，会被认为十分不吉利并且意味着夫妻将会离婚。

source: More recently, this phenomenon is changing and more people take it to mean "pair."
zh_cn: 然而就现在看来，这种现象正在改变并且更多的人把它看为“成双成对”的象征。

source: Each couple is different - some will still believe the former, while others will be in the latter group, or won't care either way.
zh_cn: 但是每队夫妻都可能不同，也许他们依然很相信传统风俗，也许他们更倾向于“成双成对”的说法，或者他们根本就不在乎这件事。

source: Couple (friends of the bride/groom)
zh_cn: 新郎或者新娘一方的夫妇朋友

source: Combine the amounts each of you would give individually.
zh_cn: 你们两个需要分开随礼然后把钱凑到一起。

source: So if 20,000 yen, individually, than 40,000 yen. If 30,000 yen, than 60,000 yen. Although some people mentioned 50,000 yen is fine for couples.
zh_cn: 所以如果是20,000日元一人，那么就要给至少40,000日元，如果是30,000日元一人，那就是至少60,000日元，但是也有人说到两个人给50,000日元就可以了。

source: Co-worker
zh_cn: 同事

source: 20,000 - 30,000 yen is the standard, although it may depend on the couple, how well you know them, the size of their wedding, whether the wedding is in a large city or small town out in the sticks, or other factors.
zh_cn: 标准是20,000到30,000日元，但是还是取决于新婚夫妻，你和他们关系的好坏程度，他们婚礼的规模大小，以及婚礼是在大城市举办还是一些边远地区的小镇里等一些其他因素。

source: Also, your status compared to them influences how much you should give.
zh_cn: 并且，你相比于他们的等级高低也影响着你随礼的多少。

source: Are you their boss? 3-50,000 yen. Similar level? 2-30,000 yen. Are they your boss? 2-30,000 yen.
zh_cn: 你如果是他们老板，那就是30,000到50,000日元，如果是相同级别，那就是20,000到30,000日元，如果他们是你的上司，就是20,000到30,000日元。

source: Some folks commented that 10,000 yen was the norm for co-workers at their wedding.
zh_cn: 有些本地人说道10,000是同事婚礼随礼的标准。

source: Family
zh_cn: 亲属

source: Not sure how many of you are or will be family, but just for kicks - the younger you are, the less money expected of you.
zh_cn: 不确定你有多少亲属或者即将成为亲属的人，但是值得注意的是：你年龄越小，随的礼金就越少。

source: So if you're upper 30's and 40's, be prepared to fork over the cash (up to 100,000 yen!).
zh_cn: 但是如果你已经30,40多岁了，那就好好准备一笔大钱吧（高达100,000日元！）。

source: Cousins give less than siblings if in their 20's, but give the same if 30's and up.
zh_cn: 旁系兄弟姐妹如果20多岁，就比直系兄弟姐妹随的少一些，但是如果已经三十岁以上了随的数目都是一样的。

source: Someone also mentioned that if there are particular circumstances such as low income, loss of job, serious illness, or something similar, which hinder the person or family's ability to give the "average" amount, this is perfectly understandable.
zh_cn: 有些人同样提到如果有一些特殊情况譬如低收入，失业，严重疾病，或者一些相同的情况，限制这个人或者家庭去拿出这些“平均”礼金的能力，这是完全可以理解的。

source: Now, for those of you completely new to Japan, and reading this just stresses you out, don't worry. Your presence at a Japanese wedding is quite exotic and they'll be just thrilled to have you there.
zh_cn: 现在，对于那些初来日本的人来说可能读完这篇文章就会觉得压力山大，但是完全不用担心，你出现在一个日本婚礼上本来就是一件不寻常的事，他们只会对你的到场感到惊奇。

source: At least if you try to get it right, they'll appreciate the effort.
zh_cn: 至少你尝试着去了解如何去做对这些事情，他们会欣赏你的努力的。

source: I messed up royally and everyone still bowed to me incessantly the entire reception, thanking me repeatedly for coming.
zh_cn: 我曾经完完全全搞砸了但是他们还是在宴会上不断地向我鞠躬，反复感谢我的到来。

source: And, they let me win Bingo...
zh_cn: 并且，他们让我赢了宾果游戏......

source: As I suggested in the previous post, just ask around if you are really worried about it - if you're a co-worker, find out what other co-workers are giving (in a polite way of course, and make it sound like you really just have no idea and need their infinite wisdom).
zh_cn: 就像我之前一篇文章说的，如果你非常担心的话就到处问一问，如果你是对方同事，那就搞清楚其他同事给什么（当然是用礼貌的语气问并且要让这语气听起来好像你真的一无所知而且需要他们无穷的智慧一样）。

source: Then, just relax! Enjoy yourself, and enjoy possibly being a source of entertainment for the entire crowd.
zh_cn: 然后，放松就好了！自己玩的愉快，如果可能的话，试着去成为让所有人开心的源泉吧。
